Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
// © Primus1C  24.08.2024  НАЧАЛО ►

#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	//Элементы.РучнойШК.Видимость = гоПользователь().КлавиатурныйСканерШК;

	СписокСкладов.ЗагрузитьЗначения(Объект.Склады.Выгрузить().ВыгрузитьКолонку("Склад"));      
	
	//СтруктураПечатныхФорм = Документы.Инвентаризация.ПолучитьСтруктуруПечатныхФорм();  
	//ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	//ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
	ОдинСклад = Объект.Склады.Количество() < 2;   
	
	//ПредупреждатьОДублях = Истина;
	
	СтруктураПечатныхФорм = Документы.Инвентаризация.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	Если НЕ ЗначениеЗаполнено(РежимПредупреждения) Тогда
	 	РежимПредупреждения = Элементы.РежимПредупреждения.СписокВыбора.Получить(0).Значение;
	КонецЕсли; 
	
	РаботаСоСканеромШК.СканерШКПодключить(); 
	
	ОбновитьОтображениеСкладов();
	
	УстановитьДоступность();

	ПредупреждатьОДублях = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
      
	Объект.Склады.Очистить();
	Если ОдинСклад Тогда
		
	Иначе          
		Объект.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		Для каждого Эл Из СписокСкладов Цикл
			СтрокаТЧ = Объект.Склады.Добавить();
			СтрокаТЧ.Склад = Эл.Значение;  
		КонецЦикла;	
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда Возврат КонецЕсли; 
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда  
		ЛюбаяСерия(ШК);
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Предупредить(ТекстПредупреждения)
	
	Если СтрНайти(НРег(РежимПредупреждения), "текст") > 0 Тогда
   		клОшибка(ТекстПредупреждения); 	
	КонецЕсли;	
	Если СтрНайти(НРег(РежимПредупреждения), "голос") > 0 Тогда
		клПроизнестиГолосом(ТекстПредупреждения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(РучнойШК) Тогда
		ЛюбаяСерия(РучнойШК, Истина);  
	Иначе
		РучнойШК = "";
	КонецЕсли;

КонецПроцедуры

 &НаКлиенте
Процедура ЛюбаяСерия(НовСер, СтатьНаРучной = Ложь)

	ШК = СокрЛП(НовСер);
	
	НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Серия", ШК)); 
	Если НайдСтроки.Количество() > 0 И ПредупреждатьОДублях Тогда
		Предупредить(НСтр("ru = 'Штрих код уже есть в документе!'; en = 'The barcode is already in the document.!'"));
		Если СтатьНаРучной Тогда 
			РучнойШК = "";
			ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
		КонецЕсли; 
		Возврат;
	КонецЕсли;  
	
	Если ПартияЕстьВДругихИнвентаризациях(ШК, Объект.Дата, Объект.Ссылка) Тогда
		Предупредить(НСтр("ru = 'Штрих код уже есть в других документах инвентаризации!'; en = 'The barcode already exists in other inventory documents.!'"));
		Если СтатьНаРучной Тогда 
			РучнойШК = "";
			ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
		КонецЕсли; 
		Возврат;
	КонецЕсли;
	
	//Если СерияЕстьНаДругихСкладах(ШК, Объект.Склад, Объект.Дата) Тогда
	//	Предупредить(НСтр("ru = 'Штрих код есть на другом складе!'; en = 'Штрих код есть на другом складе!'"));
	//	Если СтатьНаРучной Тогда 
	//		РучнойШК = "";
	//		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	//	КонецЕсли; 
	//	Возврат;
	//КонецЕсли;
	
	НайденнаяПартия = Партия(ШК);

	Если НЕ ЗначениеЗаполнено(НайденнаяПартия.Номенклатура) Тогда
		Предупредить(НСтр("ru = 'Не найден товар по штрих коду!'; en = 'Good not found by barcode!'"));
	КонецЕсли;
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НайденнаяПартия.Номенклатура; 
	НовСтр.Партия 		= НайденнаяПартия.Партия;
	НовСтр.Серия 		= ШК;
	НовСтр.Количество 	= 1;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	Записать();
	
	//гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция СерияЕстьНаДругихСкладах(Серия, Склад, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТовараОстатки.ОстатокОстаток КАК Остаток,
	               |	ОстаткиТовараОстатки.РезервОстаток КАК Резерв,
	               |	ОстаткиТовараОстатки.Партия.Серия КАК ПартияСерия
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.Остатки(
	               |			&Дата,
	               |			Партия.Серия = &Серия
	               |				И Склад <> &Склад) КАК ОстаткиТовараОстатки
	               |ГДЕ
	               |	ОстаткиТовараОстатки.ОстатокОстаток > 0";
	Запрос.УстановитьПараметр("Серия", 	Серия);
	Запрос.УстановитьПараметр("Склад", 	Склад);
	Запрос.УстановитьПараметр("Дата", 	Дата);

	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();

КонецФункции 

&НаСервереБезКонтекста
Функция ПартияЕстьВДругихИнвентаризациях(ШК, Дата, ДокСсылка)

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ИнвентаризацияТовары.Серия КАК Серия
	             |ИЗ
	             |	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	             |ГДЕ
	             |	ИнвентаризацияТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	             |	И НЕ ИнвентаризацияТовары.Ссылка.ПометкаУдаления
	             |	И ИнвентаризацияТовары.Серия = &Серия
	             //|	И ИнвентаризацияТовары.Ссылка <> &Ссылка
				 |";
	Запр.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запр.УстановитьПараметр("ДатаКон", КонецДня(Дата));	
	Запр.УстановитьПараметр("Серия", ШК);	
	//Запр.УстановитьПараметр("Ссылка", ДокСсылка);	
	результатЗапроса = Запр.Выполнить();
	Возврат НЕ результатЗапроса.Пустой();
	
КонецФункции 

&НаСервереБезКонтекста
Функция Партия(Серия)

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Серия", Серия);
	Запр.Текст = "ВЫБРАТЬ
	             |	Партии.Ссылка КАК Партия,
	             |	Партии.Владелец КАК Номенклатура
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Серия = &Серия
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Партии.ПометкаУдаления";
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Номенклатура,Партия", Выборка.Номенклатура, Выборка.Партия);
	Иначе
		Возврат Новый Структура("Номенклатура,Партия", Справочники.Номенклатура.ПустаяСсылка(), Справочники.Партии.ПустаяСсылка());
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;

КонецПроцедуры


#Область Команды
	            
&НаКлиенте
Процедура Установить(Команда)

	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>? 
							|Документ будет проведен.'; en = 'Set flag <Finaly>?'"));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Попытка
		Объект.Окончательно = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));             
		УстановитьДоступность();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
//	гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);	

КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	//// © Primus1C  06.02.2024  НАЧАЛО ►
	//Если ОбщегоНазначенияПовтИсп.ДоступБухгалтерии() Тогда
	//	Если клНетДа(НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'")) Тогда Возврат КонецЕсли;
	//	Объект.Окончательно = Ложь;
	//	МояЗаписать(Ложь);    
	//	МоиИтоги();
	//	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);    
	//	Возврат;
	//КонецЕсли;
	//// © Primus1C  ОКОНЧАНИЕ ◄

	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	//
	//Сч = 0;
	//Для Каждого Стр Из Объект.Товары Цикл
	//	Нельзя = ?(НельзяРедактироватьЦену(Стр.Партия), 1, 0);
	//	Сч = Сч + Нельзя;
	//	Если Нельзя = 0 Тогда Продолжить КонецЕсли;
	//	Сообщить(НСтр("ru = 'Есть движения партии: '; en = 'Batches movements are posted: '") + гоИмя(Стр.Партия));
	//КонецЦикла;
	//
	////Если НЕ гоЕстьРоль("Оператор") Тогда
	//	Если Сч <> 0 Тогда клОшибка(НСтр("ru = 'Есть движения партий '; en = 'Batches movements are posted '") + гоИмя(Сч) + "!"); Возврат; КонецЕсли;
	////КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	//МояЗаписать(Ложь);
	Записать();
	УстановитьДоступность();

	//гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);

КонецПроцедуры

#КонецОбласти   


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.Инвентаризация.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти


&НаКлиенте
Процедура УстановитьДоступность()

	Для каждого Элемент Из Элементы Цикл 
		Тип = ТипЗнч(Элемент);
		Если Тип = Тип("ПолеФормы") ИЛИ Тип = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Объект.Окончательно; 
		ИначеЕсли Тип = Тип("КнопкаФормы") И Элемент.Родитель <> Элементы.ФормаКоманднаяПанель Тогда
			Элемент.Доступность = НЕ Объект.Окончательно;
		КонецЕсли;
	КонецЦикла;	    
	Если Элементы.Найти("Снять") <> Неопределено Тогда
		Элементы.Снять.Доступность = Объект.Окончательно;
	КонецЕсли;
	Если Элементы.Найти("Установить") <> Неопределено Тогда
		Элементы.Установить.Доступность = НЕ Объект.Окончательно;
	КонецЕсли;
	Элементы.Окончательно.ТолькоПросмотр = Истина;
	Элементы.ПредупреждатьОДублях.ТолькоПросмотр = Истина;	
	Элементы.ТоварыСерия.ТолькоПросмотр = Истина;	
	Элементы.ТоварыКоличество.ТолькоПросмотр = Истина;	
	
КонецПроцедуры


#Область Склады
	
&НаСервереБезКонтекста
Функция СкладыДляВыбора(СписокПомеченных)
	
	Спис = Новый СписокЗначений;
	Запр = новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Склады.Ссылка КАК Ссылка,
	             |	ИСТИНА КАК Пометка
	             |ИЗ
	             |	Справочник.Склады КАК Склады
	             |ГДЕ
	             |	НЕ Склады.ПометкаУдаления";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	 	Спис.Добавить(Выборка.Ссылка, , СписокПомеченных.НайтиПОЗначению(Выборка.Ссылка) <> Неопределено);
	КонецЦикла;
	Возврат Спис;
	
КонецФункции // СладыДляВыбора()

&НаКлиенте
Процедура ОбновитьОтображениеСкладов()
	
	Элементы.Склад.Видимость = ОдинСклад;
	Элементы.Склады.Видимость = НЕ ОдинСклад;

	Если СписокСкладов.Количество() = 0 Тогда
		Склады = НСтр("ru = '<не выбраны>'; en = '<not selected>'")	
	Иначе 
		Загл = "";
		Для каждого Эл Из СписокСкладов Цикл
		 	Загл = Загл + Эл.Значение + ", ";
		КонецЦикла;
		Склады = Загл;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Список, Параметры) Экспорт
	
	Если Список <> Неопределено Тогда  
		СписокСкладов.Очистить();
        Для каждого Элемент из Список Цикл
            Если Элемент.Пометка И СписокСкладов.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
				СписокСкладов.Добавить(Элемент.Значение); 
            КонецЕсли;
        КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	ОбновитьОтображениеСкладов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОдинСкладПриИзменении(Элемент)
	
	ОбновитьОтображениеСкладов();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СписокСкладов.Очистить();
	СписокСкладов.Добавить(Объект.Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	СкладыДляВыбора = СкладыДляВыбора(СписокСкладов);
	СкладыДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, НСтр("ru = 'Остатки на складах'; en = 'Warehouse balances'"));

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;

	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли;

	клНетДа(Новый ОписаниеОповещения("ТоварыПередУдалениемЗавершение", ЭтотОбъект, Стр),
		НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалениемЗавершение(Результат, Стр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Объект.Товары.Удалить(Стр);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти


// © Primus1C  ОКОНЧАНИЕ ◄
